Revit 2024 API
BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeWarning Property
 The selected fitting(s) cannot maintain connections to existing fabrication parts due to size, direction or angle differences. You must manually reconnect the open connections.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FabricationPartCannotChangeTypeWarning { get; }
Visual Basic
Public Shared ReadOnly Property FabricationPartCannotChangeTypeWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FabricationPartCannotChangeTypeWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace